// Написать программу которая принимает число и выдает его квадрат
Console.Write("Введите число: ");
string nuberString = Console.ReadLine();
int number = Convert.ToInt32(nuberString);
Console.Write("Квадрат числа: ");
Console.Write(number*number);